{
  "type": "unknown",
  "name": "Number",
  "signature": "abstract class Number",
  "items": [
    {
      "text": "<init>()",
      "desc": "Superclass for all platform classes representing numeric values."
    },
    {
      "text": "abstract fun toByte(): Byte",
      "desc": "Returns the value of this number as a Byte, which may involve rounding or truncation."
    },
    {
      "text": "abstract fun toChar(): Char",
      "desc": "Returns the Char with the numeric value equal to this number, truncated to 16 bits if appropriate."
    },
    {
      "text": "abstract fun toDouble(): Double",
      "desc": "Returns the value of this number as a Double, which may involve rounding."
    },
    {
      "text": "abstract fun toFloat(): Float",
      "desc": "Returns the value of this number as a Float, which may involve rounding."
    },
    {
      "text": "abstract fun toInt(): Int",
      "desc": "Returns the value of this number as an Int, which may involve rounding or truncation."
    },
    {
      "text": "abstract fun toLong(): Long",
      "desc": "Returns the value of this number as a Long, which may involve rounding or truncation."
    },
    {
      "text": "abstract fun toShort(): Short",
      "desc": "Returns the value of this number as a Short, which may involve rounding or truncation."
    },
    {
      "text": "fun <R : Number> Number.narrow(): R"
    },
    {
      "text": "fun <R : Number> Number.signExtend(): R"
    },
    {
      "text": "class Byte : Number, Comparable<Byte>",
      "desc": "Represents a 8-bit signed integer. On the JVM, non-nullable values of this type are represented as values of the primitive type byte."
    },
    {
      "text": "class Double : Number, Comparable<Double>",
      "desc": "Represents a double-precision 64-bit IEEE 754 floating point number. On the JVM, non-nullable values of this type are represented as values of the primitive type double."
    },
    {
      "text": "class Float : Number, Comparable<Float>",
      "desc": "Represents a single-precision 32-bit IEEE 754 floating point number. On the JVM, non-nullable values of this type are represented as values of the primitive type float."
    },
    {
      "text": "class Int : Number, Comparable<Int>",
      "desc": "Represents a 32-bit signed integer. On the JVM, non-nullable values of this type are represented as values of the primitive type int."
    },
    {
      "text": "class Long : Number, Comparable<Long>",
      "desc": "Represents a 64-bit signed integer. On the JVM, non-nullable values of this type are represented as values of the primitive type long."
    },
    {
      "text": "class Short : Number, Comparable<Short>",
      "desc": "Represents a 16-bit signed integer. On the JVM, non-nullable values of this type are represented as values of the primitive type short."
    }
  ]
}